Revit 2024 API
RebarUpdateCurvesData.IsBarsNumberChanged Property
 Indicates if the bar number has changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool IsBarsNumberChanged { get; }
Visual Basic
Public ReadOnly Property IsBarsNumberChanged As Boolean
	Get
Visual C++
public:
property bool IsBarsNumberChanged {
	bool get ();
}
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace